//
// Filename: "neg_te.v"
//
// Project: Троичный процессор для RISC-V
//
// Description: Операция инверсия трита. Мнемоника NEG_TE.
//
// Create date: 11.03.2025
// Edit date:   15.03.2025
//
//
// Author:      Vladimir Vasilev
// E-mail:      askfind@ya.ru
//
// GNU GENERAL PUBLIC LICENSE Version 3, 29 June 2007
//

// Таб.1 Алфавит троичной симметричной системы счисления
// +--------------------------+-------+-------+-------+
// | Числа                    |  -1   |   0   |   1   |
// +--------------------------+-------+-------+-------+
// | Логика                   | false |  nil  | true  |
// +--------------------------+-------+-------+-------+
// | Логика                   |   f   |   n   |   t   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   -   |	  0   |	  +   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   N   |	  Z   |	  P   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   N   |	  O   |	  P   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   0   |	  i   |	  1   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   v   |	  0   |	  ^   |
// +--------------------------+-------+-------+-------+

//
//   trit = {-1,0,1}  - значения трита
//

// Таб.2 Троичное инверсия трита
//       NEG
// .-----------.
// |  -  |  +  |
// |-----------|
// |  0  |  0  |
// |-----------|
// |  +  |  -  |
// .-----------.

//
// Кодирование трита и интерпретация trit:
//
// a[1:0] -> {1,0} = '+1'
// a[1:0] -> {0,0} =  '0'
// a[1:0] -> {0,1} = '-1'
// a[1:0] -> {1,1} = 'Error'
//
module neg_te(a,c,err);

input  wire[1:0] a;
output reg[1:0] c;
output err;

always @(*) begin
    case ({a})
        2'b00: c = 2'b00; // a=0 -> c=0
        2'b01: c = 2'b10; // a=1 -> c=2
        2'b10: c = 2'b01; // a=2 -> c=1
        2'b11: c = 2'b00; // a=3 -> c=0
    endcase
end

assign err = ( (a == 2'b11) || (c == 2'b11) ) ? 1 : 0;

endmodule
