//
// Filename: "opers_trit.v"
//
// Project: Троичный процессор для RISC-V
//
// Description: Троичные операции для трит.
//
// Create date: 11.03.2025
// Edit date:   15.03.2025
//
//
// Author:      Vladimir Vasilev
// E-mail:      askfind@ya.ru
//
// GNU GENERAL PUBLIC LICENSE Version 3, 29 June 2007
//

// Таб.1 Алфавит троичной симметричной системы счисления
// +--------------------------+-------+-------+-------+
// | Числа                    |  -1   |   0   |   1   |
// +--------------------------+-------+-------+-------+
// | Логика                   | false |  nil  | true  |
// +--------------------------+-------+-------+-------+
// | Логика                   |   f   |   n   |   t   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   -   |	  0   |	  +   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   N   |	  Z   |	  P   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   N   |	  O   |	  P   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   0   |	  i   |	  1   |
// +--------------------------+-------+-------+-------+
// | Символы                  |   v   |	  0   |	  ^   |
// +--------------------------+-------+-------+-------+

//
//   trit = {-1,0,1}  - значения трита
//

//
// Кодирование трита и интерпретация trit:
//
// a[1:0] -> {1,0} = '+1'
// a[1:0] -> {0,0} =  '0'
// a[1:0] -> {0,1} = '-1'
// a[1:0] -> {1,1} = 'Error'
//

module opers_trit();

endmodule
